apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_i2c.h
/************************************************************************************
 * arch/arm/src/tiva/hardware/tm4c/tm4c129_i2c.h
 *
 *   Copyright (C) 2009, 2013-2015 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C129_I2C_H
#define __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C129_I2C_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* I2C Register Offsets *************************************************************/

/* I2C Master */

#define TIVA_I2CM_SA_OFFSET            0x0000 /* I2C Master Slave Address */
#define TIVA_I2CM_CS_OFFSET            0x0004 /* I2C Master Control/Status */
#define TIVA_I2CM_DR_OFFSET            0x0008 /* I2C Master Data */
#define TIVA_I2CM_TPR_OFFSET           0x000c /* I2C Master Timer Period */
#define TIVA_I2CM_IMR_OFFSET           0x0010 /* I2C Master Interrupt Mask */
#define TIVA_I2CM_RIS_OFFSET           0x0014 /* I2C Master Raw Interrupt Status */
#define TIVA_I2CM_MIS_OFFSET           0x0018 /* I2C Master Masked Interrupt Status */
#define TIVA_I2CM_ICR_OFFSET           0x001c /* I2C Master Interrupt Clear */
#define TIVA_I2CM_CR_OFFSET            0x0020 /* I2C Master Configuration */
#define TIVA_I2CM_CLKOCNT_OFFSET       0x0024 /* I2C Master Clock Low Timeout Count */
#define TIVA_I2CM_BMON_OFFSET          0x002c /* I2C Master Bus Monitor */
#define TIVA_I2CM_BLEN_OFFSET          0x0030 /* I2C Master Burst Length */
#define TIVA_I2CM_BCNT_OFFSET          0x0034 /* I2C Master Burst Count */

/* I2C Slave */

#define TIVA_I2CS_OAR_OFFSET           0x0800 /* I2C Slave Own Address */
#define TIVA_I2CS_CSR_OFFSET           0x0804 /* I2C Slave Control/Status */
#define TIVA_I2CS_DR_OFFSET            0x0808 /* I2C Slave Data */
#define TIVA_I2CS_IMR_OFFSET           0x080c /* I2C Slave Interrupt Mask */
#define TIVA_I2CS_RIS_OFFSET           0x0810 /* I2C Slave Raw Interrupt Status */
#define TIVA_I2CS_MIS_OFFSET           0x0814 /* I2C Slave Masked Interrupt Status */
#define TIVA_I2CS_ICR_OFFSET           0x0818 /* I2C Slave Interrupt Clear */
#define TIVA_I2CS_SOAR2_OFFSET         0x081c /* I2C Slave Own Address 2 */
#define TIVA_I2CS_ACKCTL_OFFSET        0x0820 /* I2C Slave ACK Control */

/* I2C Status and control */

#define TIVA_I2CSC_FIFODATA_OFFSET     0x0f00 /* I2C FIFO Data */
#define TIVA_I2CSC_FIFOCTL_OFFSET      0x0f04 /* I2C FIFO Control */
#define TIVA_I2CSC_FIFOSTATUS_OFFSET   0x0f08 /* I2C FIFO Status */
#define TIVA_I2CSC_PP_OFFSET           0x0fc0 /* I2C Peripheral Properties */
#define TIVA_I2CSC_PC_OFFSET           0x0fc4 /* I2C Peripheral Configuration */

/* I2C Register Addresses ***********************************************************/

#if TIVA_NI2C > 0

/* I2C0 Master */

#define TIVA_I2CM0_SA                  (TIVA_I2C0_BASE + TIVA_I2CM_SA_OFFSET)
#define TIVA_I2CM0_CS                  (TIVA_I2C0_BASE + TIVA_I2CM_CS_OFFSET)
#define TIVA_I2CM0_DR                  (TIVA_I2C0_BASE + TIVA_I2CM_DR_OFFSET)
#define TIVA_I2CM0_TPR                 (TIVA_I2C0_BASE + TIVA_I2CM_TPR_OFFSET)
#define TIVA_I2CM0_IMR                 (TIVA_I2C0_BASE + TIVA_I2CM_IMR_OFFSET)
#define TIVA_I2CM0_RIS                 (TIVA_I2C0_BASE + TIVA_I2CM_RIS_OFFSET)
#define TIVA_I2CM0_MIS                 (TIVA_I2C0_BASE + TIVA_I2CM_MIS_OFFSET)
#define TIVA_I2CM0_ICR                 (TIVA_I2C0_BASE + TIVA_I2CM_ICR_OFFSET)
#define TIVA_I2CM0_CR                  (TIVA_I2C0_BASE + TIVA_I2CM_CR_OFFSET)
#define TIVA_I2CM0_CLKOCNT             (TIVA_I2C0_BASE + TIVA_I2CM_CLKOCNT_OFFSET)
#define TIVA_I2CM0_BMON                (TIVA_I2C0_BASE + TIVA_I2CM_BMON_OFFSET)
#define TIVA_I2CM0_BLEN                (TIVA_I2C0_BASE + TIVA_I2CM_BLEN_OFFSET)
#define TIVA_I2CM0_BCNT                (TIVA_I2C0_BASE + TIVA_I2CM_BCNT_OFFSET)

/* I2C0 Slave */

#define TIVA_I2CS0_OAR                 (TIVA_I2C0_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS0_CSR                 (TIVA_I2C0_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS0_DR                  (TIVA_I2C0_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS0_IMR                 (TIVA_I2C0_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS0_RIS                 (TIVA_I2C0_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS0_MIS                 (TIVA_I2C0_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS0_ICR                 (TIVA_I2C0_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS0_SOAR2               (TIVA_I2C0_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS0_ACKCTL              (TIVA_I2C0_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C0 Status and control */

#define TIVA_I2CSC0_FIFODATA           (TIVA_I2C0_BASE + TIVA_I2CSC_FIFODATA_OFFSET)
#define TIVA_I2CSC0_FIFOCTL            (TIVA_I2C0_BASE + TIVA_I2CSC_FIFOCTL_OFFSET)
#define TIVA_I2CSC0_FIFOSTATUS         (TIVA_I2C0_BASE + TIVA_I2CSC_FIFOSTATUS_OFFSET)
#define TIVA_I2CSC0_PP                 (TIVA_I2C0_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC0_PC                 (TIVA_I2C0_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 0 */

#if TIVA_NI2C > 1

/* I2C1 Master */

#define TIVA_I2CM1_SA                  (TIVA_I2C1_BASE + TIVA_I2CM_SA_OFFSET)
#define TIVA_I2CM1_CS                  (TIVA_I2C1_BASE + TIVA_I2CM_CS_OFFSET)
#define TIVA_I2CM1_DR                  (TIVA_I2C1_BASE + TIVA_I2CM_DR_OFFSET)
#define TIVA_I2CM1_TPR                 (TIVA_I2C1_BASE + TIVA_I2CM_TPR_OFFSET)
#define TIVA_I2CM1_IMR                 (TIVA_I2C1_BASE + TIVA_I2CM_IMR_OFFSET)
#define TIVA_I2CM1_RIS                 (TIVA_I2C1_BASE + TIVA_I2CM_RIS_OFFSET)
#define TIVA_I2CM1_MIS                 (TIVA_I2C1_BASE + TIVA_I2CM_MIS_OFFSET)
#define TIVA_I2CM1_ICR                 (TIVA_I2C1_BASE + TIVA_I2CM_ICR_OFFSET)
#define TIVA_I2CM1_CR                  (TIVA_I2C1_BASE + TIVA_I2CM_CR_OFFSET)
#define TIVA_I2CM1_CLKOCNT             (TIVA_I2C1_BASE + TIVA_I2CM_CLKOCNT_OFFSET)
#define TIVA_I2CM1_BMON                (TIVA_I2C1_BASE + TIVA_I2CM_BMON_OFFSET)
#define TIVA_I2CM1_BLEN                (TIVA_I2C1_BASE + TIVA_I2CM_BLEN_OFFSET)
#define TIVA_I2CM1_BCNT                (TIVA_I2C1_BASE + TIVA_I2CM_BCNT_OFFSET)

/* I2C1 Slave */

