apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_i2c.h
#define TIVA_I2CS1_OAR                 (TIVA_I2C1_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS1_CSR                 (TIVA_I2C1_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS1_DR                  (TIVA_I2C1_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS1_IMR                 (TIVA_I2C1_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS1_RIS                 (TIVA_I2C1_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS1_MIS                 (TIVA_I2C1_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS1_ICR                 (TIVA_I2C1_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS1_SOAR2               (TIVA_I2C1_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS1_ACKCTL              (TIVA_I2C1_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C1 Status and control */

#define TIVA_I2CSC1_FIFODATA           (TIVA_I2C1_BASE + TIVA_I2CSC_FIFODATA_OFFSET)
#define TIVA_I2CSC1_FIFOCTL            (TIVA_I2C1_BASE + TIVA_I2CSC_FIFOCTL_OFFSET)
#define TIVA_I2CSC1_FIFOSTATUS         (TIVA_I2C1_BASE + TIVA_I2CSC_FIFOSTATUS_OFFSET)
#define TIVA_I2CSC1_PP                 (TIVA_I2C1_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC1_PC                 (TIVA_I2C1_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 1 */

#if TIVA_NI2C > 2

/* I2C2 Master */

#define TIVA_I2CM2_SA                  (TIVA_I2C2_BASE + TIVA_I2CM_SA_OFFSET)
#define TIVA_I2CM2_CS                  (TIVA_I2C2_BASE + TIVA_I2CM_CS_OFFSET)
#define TIVA_I2CM2_DR                  (TIVA_I2C2_BASE + TIVA_I2CM_DR_OFFSET)
#define TIVA_I2CM2_TPR                 (TIVA_I2C2_BASE + TIVA_I2CM_TPR_OFFSET)
#define TIVA_I2CM2_IMR                 (TIVA_I2C2_BASE + TIVA_I2CM_IMR_OFFSET)
#define TIVA_I2CM2_RIS                 (TIVA_I2C2_BASE + TIVA_I2CM_RIS_OFFSET)
#define TIVA_I2CM2_MIS                 (TIVA_I2C2_BASE + TIVA_I2CM_MIS_OFFSET)
#define TIVA_I2CM2_ICR                 (TIVA_I2C2_BASE + TIVA_I2CM_ICR_OFFSET)
#define TIVA_I2CM2_CR                  (TIVA_I2C2_BASE + TIVA_I2CM_CR_OFFSET)
#define TIVA_I2CM2_CLKOCNT             (TIVA_I2C2_BASE + TIVA_I2CM_CLKOCNT_OFFSET)
#define TIVA_I2CM2_BMON                (TIVA_I2C2_BASE + TIVA_I2CM_BMON_OFFSET)
#define TIVA_I2CM2_BLEN                (TIVA_I2C2_BASE + TIVA_I2CM_BLEN_OFFSET)
#define TIVA_I2CM2_BCNT                (TIVA_I2C2_BASE + TIVA_I2CM_BCNT_OFFSET)

/* I2C2 Slave */

#define TIVA_I2CS2_OAR                 (TIVA_I2C2_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS2_CSR                 (TIVA_I2C2_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS2_DR                  (TIVA_I2C2_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS2_IMR                 (TIVA_I2C2_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS2_RIS                 (TIVA_I2C2_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS2_MIS                 (TIVA_I2C2_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS2_ICR                 (TIVA_I2C2_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS2_SOAR2               (TIVA_I2C2_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS2_ACKCTL              (TIVA_I2C2_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C2 Status and control */

#define TIVA_I2CSC2_FIFODATA           (TIVA_I2C2_BASE + TIVA_I2CSC_FIFODATA_OFFSET)
#define TIVA_I2CSC2_FIFOCTL            (TIVA_I2C2_BASE + TIVA_I2CSC_FIFOCTL_OFFSET)
#define TIVA_I2CSC2_FIFOSTATUS         (TIVA_I2C2_BASE + TIVA_I2CSC_FIFOSTATUS_OFFSET)
#define TIVA_I2CSC2_PP                 (TIVA_I2C2_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC2_PC                 (TIVA_I2C2_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 2 */

#if TIVA_NI2C > 3

/* I2C3 Master */

#define TIVA_I2CM3_SA                  (TIVA_I2C3_BASE + TIVA_I2CM_SA_OFFSET)
#define TIVA_I2CM3_CS                  (TIVA_I2C3_BASE + TIVA_I2CM_CS_OFFSET)
#define TIVA_I2CM3_DR                  (TIVA_I2C3_BASE + TIVA_I2CM_DR_OFFSET)
#define TIVA_I2CM3_TPR                 (TIVA_I2C3_BASE + TIVA_I2CM_TPR_OFFSET)
#define TIVA_I2CM3_IMR                 (TIVA_I2C3_BASE + TIVA_I2CM_IMR_OFFSET)
#define TIVA_I2CM3_RIS                 (TIVA_I2C3_BASE + TIVA_I2CM_RIS_OFFSET)
#define TIVA_I2CM3_MIS                 (TIVA_I2C3_BASE + TIVA_I2CM_MIS_OFFSET)
#define TIVA_I2CM3_ICR                 (TIVA_I2C3_BASE + TIVA_I2CM_ICR_OFFSET)
#define TIVA_I2CM3_CR                  (TIVA_I2C3_BASE + TIVA_I2CM_CR_OFFSET)
#define TIVA_I2CM3_CLKOCNT             (TIVA_I2C3_BASE + TIVA_I2CM_CLKOCNT_OFFSET)
#define TIVA_I2CM3_BMON                (TIVA_I2C3_BASE + TIVA_I2CM_BMON_OFFSET)
#define TIVA_I2CM3_BLEN                (TIVA_I2C3_BASE + TIVA_I2CM_BLEN_OFFSET)
#define TIVA_I2CM3_BCNT                (TIVA_I2C3_BASE + TIVA_I2CM_BCNT_OFFSET)

/* I2C3 Slave */

#define TIVA_I2CS3_OAR                 (TIVA_I2C3_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS3_CSR                 (TIVA_I2C3_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS3_DR                  (TIVA_I2C3_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS3_IMR                 (TIVA_I2C3_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS3_RIS                 (TIVA_I2C3_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS3_MIS                 (TIVA_I2C3_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS3_ICR                 (TIVA_I2C3_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS3_SOAR2               (TIVA_I2C3_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS3_ACKCTL              (TIVA_I2C3_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C3 Status and control */

#define TIVA_I2CSC3_FIFODATA           (TIVA_I2C3_BASE + TIVA_I2CSC_FIFODATA_OFFSET)
#define TIVA_I2CSC3_FIFOCTL            (TIVA_I2C3_BASE + TIVA_I2CSC_FIFOCTL_OFFSET)
#define TIVA_I2CSC3_FIFOSTATUS         (TIVA_I2C3_BASE + TIVA_I2CSC_FIFOSTATUS_OFFSET)
#define TIVA_I2CSC3_PP                 (TIVA_I2C3_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC3_PC                 (TIVA_I2C3_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 3 */

#if TIVA_NI2C > 4

/* I2C4 Master */

#define TIVA_I2CM4_SA                  (TIVA_I2C4_BASE + TIVA_I2CM_SA_OFFSET)
#define TIVA_I2CM4_CS                  (TIVA_I2C4_BASE + TIVA_I2CM_CS_OFFSET)
#define TIVA_I2CM4_DR                  (TIVA_I2C4_BASE + TIVA_I2CM_DR_OFFSET)
#define TIVA_I2CM4_TPR                 (TIVA_I2C4_BASE + TIVA_I2CM_TPR_OFFSET)
#define TIVA_I2CM4_IMR                 (TIVA_I2C4_BASE + TIVA_I2CM_IMR_OFFSET)
#define TIVA_I2CM4_RIS                 (TIVA_I2C4_BASE + TIVA_I2CM_RIS_OFFSET)
#define TIVA_I2CM4_MIS                 (TIVA_I2C4_BASE + TIVA_I2CM_MIS_OFFSET)
#define TIVA_I2CM4_ICR                 (TIVA_I2C4_BASE + TIVA_I2CM_ICR_OFFSET)
#define TIVA_I2CM4_CR                  (TIVA_I2C4_BASE + TIVA_I2CM_CR_OFFSET)
#define TIVA_I2CM4_CLKOCNT             (TIVA_I2C4_BASE + TIVA_I2CM_CLKOCNT_OFFSET)
#define TIVA_I2CM4_BMON                (TIVA_I2C4_BASE + TIVA_I2CM_BMON_OFFSET)
#define TIVA_I2CM4_BLEN                (TIVA_I2C4_BASE + TIVA_I2CM_BLEN_OFFSET)
#define TIVA_I2CM4_BCNT                (TIVA_I2C4_BASE + TIVA_I2CM_BCNT_OFFSET)

/* I2C4 Slave */

#define TIVA_I2CS4_OAR                 (TIVA_I2C4_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS4_CSR                 (TIVA_I2C4_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS4_DR                  (TIVA_I2C4_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS4_IMR                 (TIVA_I2C4_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS4_RIS                 (TIVA_I2C4_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS4_MIS                 (TIVA_I2C4_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS4_ICR                 (TIVA_I2C4_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS4_SOAR2               (TIVA_I2C4_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS4_ACKCTL              (TIVA_I2C4_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C4 Status and control */

#define TIVA_I2CSC4_FIFODATA           (TIVA_I2C4_BASE + TIVA_I2CSC_FIFODATA_OFFSET)
#define TIVA_I2CSC4_FIFOCTL            (TIVA_I2C4_BASE + TIVA_I2CSC_FIFOCTL_OFFSET)
#define TIVA_I2CSC4_FIFOSTATUS         (TIVA_I2C4_BASE + TIVA_I2CSC_FIFOSTATUS_OFFSET)
#define TIVA_I2CSC4_PP                 (TIVA_I2C4_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC4_PC                 (TIVA_I2C4_BASE + TIVA_I2CSC_PC_OFFSET)

