apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_i2c.h
#define TIVA_I2CS8_OAR                 (TIVA_I2C8_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS8_CSR                 (TIVA_I2C8_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS8_DR                  (TIVA_I2C8_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS8_IMR                 (TIVA_I2C8_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS8_RIS                 (TIVA_I2C8_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS8_MIS                 (TIVA_I2C8_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS8_ICR                 (TIVA_I2C8_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS8_SOAR2               (TIVA_I2C8_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS8_ACKCTL              (TIVA_I2C8_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C Status and control */

#define TIVA_I2CSC8_FIFODATA           (TIVA_I2C8_BASE + TIVA_I2CSC_FIFODATA_OFFSET)
#define TIVA_I2CSC8_FIFOCTL            (TIVA_I2C8_BASE + TIVA_I2CSC_FIFOCTL_OFFSET)
#define TIVA_I2CSC8_FIFOSTATUS         (TIVA_I2C8_BASE + TIVA_I2CSC_FIFOSTATUS_OFFSET)
#define TIVA_I2CSC8_PP                 (TIVA_I2C8_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC8_PC                 (TIVA_I2C8_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 5 */

#if TIVA_NI2C > 9

/* I2C9 Master */

#define TIVA_I2CM9_SA                  (TIVA_I2C9_BASE + TIVA_I2CM_SA_OFFSET)
#define TIVA_I2CM9_CS                  (TIVA_I2C9_BASE + TIVA_I2CM_CS_OFFSET)
#define TIVA_I2CM9_DR                  (TIVA_I2C9_BASE + TIVA_I2CM_DR_OFFSET)
#define TIVA_I2CM9_TPR                 (TIVA_I2C9_BASE + TIVA_I2CM_TPR_OFFSET)
#define TIVA_I2CM9_IMR                 (TIVA_I2C9_BASE + TIVA_I2CM_IMR_OFFSET)
#define TIVA_I2CM9_RIS                 (TIVA_I2C9_BASE + TIVA_I2CM_RIS_OFFSET)
#define TIVA_I2CM9_MIS                 (TIVA_I2C9_BASE + TIVA_I2CM_MIS_OFFSET)
#define TIVA_I2CM9_ICR                 (TIVA_I2C9_BASE + TIVA_I2CM_ICR_OFFSET)
#define TIVA_I2CM9_CR                  (TIVA_I2C9_BASE + TIVA_I2CM_CR_OFFSET)
#define TIVA_I2CM9_CLKOCNT             (TIVA_I2C9_BASE + TIVA_I2CM_CLKOCNT_OFFSET)
#define TIVA_I2CM9_BMON                (TIVA_I2C9_BASE + TIVA_I2CM_BMON_OFFSET)
#define TIVA_I2CM9_BLEN                (TIVA_I2C9_BASE + TIVA_I2CM_BLEN_OFFSET)
#define TIVA_I2CM9_BCNT                (TIVA_I2C9_BASE + TIVA_I2CM_BCNT_OFFSET)

/* I2C9 Slave */

#define TIVA_I2CS9_OAR                 (TIVA_I2C9_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS9_CSR                 (TIVA_I2C9_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS9_DR                  (TIVA_I2C9_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS9_IMR                 (TIVA_I2C9_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS9_RIS                 (TIVA_I2C9_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS9_MIS                 (TIVA_I2C9_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS9_ICR                 (TIVA_I2C9_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS9_SOAR2               (TIVA_I2C9_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS9_ACKCTL              (TIVA_I2C9_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C Status and control */

#define TIVA_I2CSC9_FIFODATA           (TIVA_I2C9_BASE + TIVA_I2CSC_FIFODATA_OFFSET)
#define TIVA_I2CSC9_FIFOCTL            (TIVA_I2C9_BASE + TIVA_I2CSC_FIFOCTL_OFFSET)
#define TIVA_I2CSC9_FIFOSTATUS         (TIVA_I2C9_BASE + TIVA_I2CSC_FIFOSTATUS_OFFSET)
#define TIVA_I2CSC9_PP                 (TIVA_I2C9_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC9_PC                 (TIVA_I2C9_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 5 */

/* I2C_Register Bit Definitions *****************************************************/

/* I2C Master Slave Address (I2CM_SA) */

#define I2CM_SA_RS                     (1 << 0)  /* Bit 0:  Receive/Send */
#define I2CM_SA_SA_SHIFT               1         /* Bits 7-1: I2C Slave Address */
#define I2CM_SA_SA_MASK                (0x7f << I2CM_SA_SA_SHIFT)

/* I2C Master Control/Status (I2CM_CS) */

#define I2CM_CS_BUSY                   (1 << 0)  /* Bit 0:  I2C Busy (read) */
#define I2CM_CS_ERROR                  (1 << 1)  /* Bit 1:  Error in last bus operation (read) */
#define I2CM_CS_ADRACK                 (1 << 2)  /* Bit 2:  Acknowledge Address (read) */
#define I2CM_CS_DATACK                 (1 << 3)  /* Bit 3:  Acknowledge Data (read) */
#define I2CM_CS_ARBLST                 (1 << 4)  /* Bit 4:  Arbitration Lost (read) */
#define I2CM_CS_IDLE                   (1 << 5)  /* Bit 5:  I2C Idle (read) */
#define I2CM_CS_BUSBSY                 (1 << 6)  /* Bit 6:  Bus Busy (read) */
#define I2CM_CS_CLKTO                  (1 << 7)  /* Bit 7:  Clock Timeout Error (read) */
#define I2CM_CS_ACTDMATX               (1 << 30) /* Bit 30: DMA TX Active Status (read) */
#define I2CM_CS_ACTDMARX               (1 << 31) /* Bit 31: DMA RX Active Status (read) */

#define I2CM_CS_RUN                    (1 << 0)  /* Bit 0:  I2C Master Enable (write) */
#define I2CM_CS_START                  (1 << 1)  /* Bit 1:  Generate START (write) */
#define I2CM_CS_STOP                   (1 << 2)  /* Bit 2:  Generate STOP (write) */
#define I2CM_CS_ACK                    (1 << 3)  /* Bit 3:  Data Acknowledge Enable (write) */
#define I2CM_CS_HS                     (1 << 4)  /* Bit 4:  High-Speed Enable (write) */
#define I2CM_CS_QCMD                   (1 << 5)  /* Bit 5:  Quick Command (write) */
#define I2CM_CS_BURST                  (1 << 6)  /* Bit 6:  Burst Enable (write) */

/* I2C Master Data (I2CM_DR) */

#define I2CM_DR_SHIFT                  (0)       /* Bits 7-0: Data transferred */
#define I2CM_DR_MASK                   (0xff << I2CM_DR_SHIFT)

/* I2C Master Timer Period (I2CM_TPR) */

#define I2CM_TPR_SHIFT                 (0)      /* Bits 6-0: SCL Clock Period */
#define I2CM_TPR_MASK                  (0x7f << I2CM_TPR_SHIFT)
#define I2CM_TPR_HS                    (1 << 7) /* Bit 7:  High-Speed Enable (write) */

#define I2CM_TPR_PULSEL_SHIFT          (16)  /* Bits 18-16: Glitch Suppression Pulse Width (write) */
#define I2CM_TPR_PULSEL_MASK           (7 << I2CM_TPR_PULSEL_SHIFT)
#  define I2CM_TPR_PULSEL_BYPASS       (0 << I2CM_TPR_PULSEL_SHIFT) /* Bypass */
#  define I2CM_TPR_PULSEL_1CLK         (1 << I2CM_TPR_PULSEL_SHIFT) /* 1 clock */
#  define I2CM_TPR_PULSEL_2CLKS        (2 << I2CM_TPR_PULSEL_SHIFT) /* 2 clocks */
#  define I2CM_TPR_PULSEL_3CLKS        (3 << I2CM_TPR_PULSEL_SHIFT) /* 3 clocks */
#  define I2CM_TPR_PULSEL_4CLKS        (4 << I2CM_TPR_PULSEL_SHIFT) /* 4 clocks */
#  define I2CM_TPR_PULSEL_8CLKS        (5 << I2CM_TPR_PULSEL_SHIFT) /* 8 clocks */
#  define I2CM_TPR_PULSEL_16CLKS       (6 << I2CM_TPR_PULSEL_SHIFT) /* 16 clocks */
#  define I2CM_TPR_PULSEL_31CLKS       (7 << I2CM_TPR_PULSEL_SHIFT) /* 31 clocks */

/* I2C Master Interrupt Mask (I2CM_IMR) */

