apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_i2c.h
#define I2CM_IMR_MIM                  (1 << 0)  /* Bit 0:  Master Interrupt Mask */
#define I2CM_IMR_CLKIM                (1 << 1)  /* Bit 1:  Clock Timeout Interrupt Mask */
#define I2CM_IMR_DMARXIM              (1 << 2)  /* Bit 2:  Receive DMA Interrupt Mask */
#define I2CM_IMR_DMATXIM              (1 << 3)  /* Bit 3:  Transmit DMA Interrupt Mask */
#define I2CM_IMR_NACKIM               (1 << 4)  /* Bit 4:  Address/Data NACK Interrupt Mask */
#define I2CM_IMR_STARTIM              (1 << 5)  /* Bit 5:  START Detection Interrupt Mask */
#define I2CM_IMR_STOPIM               (1 << 6)  /* Bit 6:  STOP Detection Interrupt Mask */
#define I2CM_IMR_ARBLOSTIM            (1 << 7)  /* Bit 7:  Arbitration Lost Interrupt Mask */
#define I2CM_IMR_TXIM                 (1 << 8)  /* Bit 8:  Transmit FIFO Request Interrupt Mask */
#define I2CM_IMR_RXIM                 (1 << 9)  /* Bit 9:  Receive FIFO Request Interrupt Mask */
#define I2CM_IMR_TXFEIM               (1 << 10) /* Bit 10: Transmit FIFO Empty Interrupt Mask */
#define I2CM_IMR_RXFFIM               (1 << 11) /* Bit 11: Receive FIFO Full Interrupt Mask */

/* I2C Master Raw Interrupt Status (I2CM_RIS) */

#define I2CM_RIS_MRIS                 (1 << 0)  /* Bit 0:  Master Raw Interrupt Status */
#define I2CM_RIS_CLKRIS               (1 << 1)  /* Bit 1:  Clock Timeout Raw Interrupt Status */
#define I2CM_RIS_DMARXRIS             (1 << 2)  /* Bit 2:  Receive DMA Interrupt Status */
#define I2CM_RIS_DMATXRIS             (1 << 3)  /* Bit 3:  Transmit DMA Interrupt Status */
#define I2CM_RIS_NACKRIS              (1 << 4)  /* Bit 4:  Address/Data NACK Interrupt Status */
#define I2CM_RIS_STARTRIS             (1 << 5)  /* Bit 5:  START Detection Interrupt Status */
#define I2CM_RIS_STOPRIS              (1 << 6)  /* Bit 6:  STOP Detection Interrupt Status */
#define I2CM_RIS_ARBLOSTRIS           (1 << 7)  /* Bit 7:  Arbitration Lost Interrupt Status */
#define I2CM_RIS_TXRIS                (1 << 8)  /* Bit 8:  Transmit FIFO Request Interrupt Status */
#define I2CM_RIS_RXRIS                (1 << 9)  /* Bit 9:  Receive FIFO Request Interrupt Status */
#define I2CM_RIS_TXFERIS              (1 << 10) /* Bit 10: Transmit FIFO Empty Interrupt Status */
#define I2CM_RIS_RXFFRIS              (1 << 11) /* Bit 11: Receive FIFO Full Interrupt Status */

/* I2C Master Masked Interrupt Status (I2CM_MIS) */

#define I2CM_MIS_MMIS                 (1 << 0)  /* Bit 0:  Maseter Masked Interrupt Status */
#define I2CM_MIS_CLKMIS               (1 << 1)  /* Bit 1:  Clock Timeout Masked Interrupt Status */
#define I2CM_MIS_DMARXMIS             (1 << 2)  /* Bit 2:  Receive DMA Interrupt Status */
#define I2CM_MIS_DMATXMIS             (1 << 3)  /* Bit 3:  Transmit DMA Interrupt Status */
#define I2CM_MIS_NACKMIS              (1 << 4)  /* Bit 4:  Address/Data NACK Interrupt Status */
#define I2CM_MIS_STARTMIS             (1 << 5)  /* Bit 5:  START Detection Interrupt Status */
#define I2CM_MIS_STOPMIS              (1 << 6)  /* Bit 6:  STOP Detection Interrupt Status */
#define I2CM_MIS_ARBLOSTMIS           (1 << 7)  /* Bit 7:  Arbitration Lost Interrupt Status */
#define I2CM_MIS_TXMIS                (1 << 8)  /* Bit 8:  Transmit FIFO Request Interrupt Status */
#define I2CM_MIS_RXMIS                (1 << 9)  /* Bit 9:  Receive FIFO Request Interrupt Status */
#define I2CM_MIS_TXFEMIS              (1 << 10) /* Bit 10: Transmit FIFO Empty Interrupt Status */
#define I2CM_MIS_RXFFMIS              (1 << 11) /* Bit 11: Receive FIFO Full Interrupt Status */

/* I2C Master Masked Interrupt Status (I2CM_ICR) */

#define I2CM_ICR_MIC                  (1 << 0)  /* Bit 0:  Master Masked Interrupt Clear */
#define I2CM_ICR_CLKC                 (1 << 1)  /* Bit 1:  Clock Timeout Interrupt Clear */
#define I2CM_ICR_DMARXIC              (1 << 2)  /* Bit 2:  Receive DMA Interrupt Clear */
#define I2CM_ICR_DMATXIC              (1 << 3)  /* Bit 3:  Transmit DMA Interrupt Clear */
#define I2CM_ICR_NACKIC               (1 << 4)  /* Bit 4:  Address/Data NACK Interrupt Clear */
#define I2CM_ICR_STARTIC              (1 << 5)  /* Bit 5:  START Detection Interrupt Clear */
#define I2CM_ICR_STOPIC               (1 << 6)  /* Bit 6:  STOP Detection Interrupt Clear */
#define I2CM_ICR_ARBLOSTIC            (1 << 7)  /* Bit 7:  Arbitration Lost Interrupt Clear */
#define I2CM_ICR_TXIC                 (1 << 8)  /* Bit 8:  Transmit FIFO Request Interrupt Clear */
#define I2CM_ICR_RXIC                 (1 << 9)  /* Bit 9:  Receive FIFO Request Interrupt Clear */
#define I2CM_ICR_TXFEIC               (1 << 10) /* Bit 10: Transmit FIFO Empty Interrupt Mask */
#define I2CM_ICR_RXFFIC               (1 << 11) /* Bit 11: Receive FIFO Full Interrupt Clear */

/* I2C Master Configuration (I2CM_CR) */

#define I2CM_CR_LPBK                   (1 << 0)  /* Bit 0:: I2C Loopback */
#define I2CM_CR_MFE                    (1 << 4)  /* Bit 4:  I2C Master Function Enable */
#define I2CM_CR_SFE                    (1 << 5)  /* Bit 5:  I2C Slave Function Enable */

/* I2C Master Clock Low Timeout Count */

#define I2CM_CLKOCNT_CNTL_SHIFT        (0)       /* Bits 7-0: I2C Master Count */
#define I2CM_CLKOCNT_CNTL_MASK         (0xff << I2CM_CLKOCNT_CNTL_SHIFT)

/* I2C Master Configuration */

#define I2CM_BMON_SCL                  (1 << 0)  /* Bit 0:  II2C SCL Status */
#define I2CM_BMON_SCA                  (1 << 1)  /* Bit 1:  II2C SDA Status */

/* I2C Master Burst Length */

#define I2CM_BLEN_SHIFT                (0)       /* Bits 7-0: I2C Burst Length */
#define I2CM_BLEN_MASK                 (0xff << I2CM_BLEN_SHIFT)

/* I2C Master Burst Count */

#define I2CM_BCNT_SHIFT                (0)       /* Bits 7-0: I2C Burst Count */
#define I2CM_BCNT_MASK                 (0xff << I2CM_BCNT_SHIFT)

/* I2C Slave Own Address (I2CS_OAR) */

#define I2CS_OAR_MASK                  0x7f      /* Bits 6-0: I2C Slave Own Address */

/* I2C Slave Control/Status (I2CS_CSR) */

#define I2CS_CSR_RREQ                  (1 << 0)  /* Bit 0:  Receive Request (read) */
#define I2CS_CSR_TREQ                  (1 << 1)  /* Bit 1:  Transmit Request (read) */
#define I2CS_CSR_FBR                   (1 << 2)  /* Bit 2:  First Byte Received (read) */
#define I2CS_CSR_OAR2SEL               (1 << 3)  /* Bit 3:  OAR2 Address Matched (read) */
#define I2CS_CSR_QCMDST                (1 << 4)  /* Bit 4:  Quick Command Status (read) */
#define I2CS_CSR_QCMDRW                (1 << 5)  /* Bit 5:  Quick Command Read / Write (read) */
#define I2CS_CSR_ACTDMATX              (1 << 30) /* Bit 30: DMA TX Active Status (read) */
#define I2CS_CSR_ACTDMARX              (1 << 31) /* Bit 31: DMA RX Active Status (read) */

#define I2CS_CSR_DA                    (1 << 0)  /* Bit 0:  Device Active (write) */
#define I2CS_CSR_TXFIFO                (1 << 1)  /* Bit 1:  TX FIFO Enable (write) */
#define I2CS_CSR_RXFIFO                (1 << 2)  /* Bit 2:  RX FIFO Enable (write) */

