apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_i2c.h
/* I2C Slave Data (I2CS_DR) */

#define I2CS_DR_SHIFT                  (0)       /* Bits 7-0: Data for Transfer */
#define I2CS_DR_MASK                   (0xff << I2CS_DR_SHIFT)

/* I2C Slave Interrupt Mask (I2CS_IMR) */

#define I2CS_IMR_DATAIM                (1 << 0)  /* Bit 0:  Data Interrupt Mask */
#define I2CS_IMR_STARTIM               (1 << 1)  /* Bit 1:  Start Condition Interrupt Mask */
#define I2CS_IMR_STOPIM                (1 << 2)  /* Bit 2:  Stop Condition Interrupt Mask */
#define I2CS_IMR_DMARXIM               (1 << 3)  /* Bit 3:  Receive DMA Interrupt Mask */
#define I2CS_IMR_DMATXIM               (1 << 4)  /* Bit 4:  Transmit DMA Interrupt Mask */
#define I2CS_IMR_TXIM                  (1 << 5)  /* Bit 5:  Transmit FIFO Request Interrupt Mask */
#define I2CS_IMR_RXIM                  (1 << 6)  /* Bit 6:  Receive FIFO Request Interrupt Mask */
#define I2CS_IMR_TXFEIM                (1 << 7)  /* Bit 7:  Transmit FIFO Empty Interrupt Mask */
#define I2CS_IMR_RXFFIM                (1 << 8)  /* Bit 8:  Receive FIFO Full Interrupt Mask */

/* I2C Slave Raw Interrupt Status (I2CS_RIS) */

#define I2CS_RIS_DATARIS               (1 << 0)  /* Bit 0:  Data Raw Interrupt Status */
#define I2CS_RIS_STARTRIS              (1 << 1)  /* Bit 1:  Start Condition Raw Interrupt Status */
#define I2CS_RIS_STOPRIS               (1 << 2)  /* Bit 2:  Stop Condition Raw Interrupt Status */
#define I2CS_RIS_DMARXRIS              (1 << 3)  /* Bit 3:  Receive DMA Interrupt Mask */
#define I2CS_RIS_DMATXRIS              (1 << 4)  /* Bit 4:  Transmit DMA Interrupt Mask */
#define I2CS_RIS_TXRIS                 (1 << 5)  /* Bit 5:  Transmit FIFO Request Interrupt Mask */
#define I2CS_RIS_RXRIS                 (1 << 6)  /* Bit 6:  Receive FIFO Request Interrupt Mask */
#define I2CS_RIS_TXFERIS               (1 << 7)  /* Bit 7:  Transmit FIFO Empty Interrupt Mask */
#define I2CS_RIS_RXFFRIS               (1 << 8)  /* Bit 8:  Receive FIFO Full Interrupt Mask */

/* I2C Slave Masked Interrupt Status (I2CS_MIS) */

#define I2CS_MIS_DATAMIS               (1 << 0)  /* Bit 0:  Data Masked Interrupt Status */
#define I2CS_MIS_STARTMIS              (1 << 1)  /* Bit 1:  Start Condition Masked Interrupt Status */
#define I2CS_MIS_STOPMIS               (1 << 2)  /* Bit 2:  Stop Condition Masked Interrupt Status */
#define I2CS_MIS_DMARXMIS              (1 << 3)  /* Bit 3:  Receive DMA Interrupt Mask */
#define I2CS_MIS_DMATXMIS              (1 << 4)  /* Bit 4:  Transmit DMA Interrupt Mask */
#define I2CS_MIS_TXMIS                 (1 << 5)  /* Bit 5:  Transmit FIFO Request Interrupt Mask */
#define I2CS_MIS_RXMIS                 (1 << 6)  /* Bit 6:  Receive FIFO Request Interrupt Mask */
#define I2CS_MIS_TXFEMIS               (1 << 7)  /* Bit 7:  Transmit FIFO Empty Interrupt Mask */
#define I2CS_MIS_RXFFMIS               (1 << 8)  /* Bit 8:  Receive FIFO Full Interrupt Mask */

/* I2C Slave Interrupt Clear (I2CS_ICR) */

#define I2CS_ICR_DATAIC                (1 << 0)  /* Bit 0:  Data Interrupt Clear */
#define I2CS_ICR_STARTIC               (1 << 1)  /* Bit 1:  Start Condition Interrupt Clear */
#define I2CS_ICR_STOPIC                (1 << 2)  /* Bit 2:  Stop Condition Interrupt Clear */
#define I2CS_ICR_DMARXIC               (1 << 3)  /* Bit 3:  Receive DMA Interrupt Mask */
#define I2CS_ICR_DMATXIC               (1 << 4)  /* Bit 4:  Transmit DMA Interrupt Mask */
#define I2CS_ICR_TXIC                  (1 << 5)  /* Bit 5:  Transmit FIFO Request Interrupt Mask */
#define I2CS_ICR_RXIC                  (1 << 6)  /* Bit 6:  Receive FIFO Request Interrupt Mask */
#define I2CS_ICR_TXFEIC                (1 << 7)  /* Bit 7:  Transmit FIFO Empty Interrupt Mask */
#define I2CS_ICR_RXFFIC                (1 << 8)  /* Bit 8:  Receive FIFO Full Interrupt Mask */

/* I2C Slave Own Address 2 */

#define I2CS_SOAR2_SHIFT               (0)       /* Bits 0-6: I2C Slave Own Address 2 */
#define I2CS_SOAR2_MASK                (0x7f << I2CS_SOAR2_SHIFT)
#define I2CS_SOAR2_OAR2EN              (1 << 7)  /* Bit 7:  I2C Slave Own Address 2 Enable */

/* I2C Slave ACK Control */

#define I2CS_ACKCTL_ACKOEN             (1 << 0)  /* Bit 0:  I2C Slave ACK Override Enable */
#define I2CS_ACKCTL_ACKOVAL            (1 << 1)  /* Bit 1:  I2C Slave ACK Override Value */

/* I2C FIFO Data */

#define I2CSC_FIFODATA_SHIFT           (0)       /* Bits 7-0: I2C RX FIFO Read / Write Data Byte */
#define I2CSC_FIFODATA_MASK            (0xff << I2CSC_FIFODATA_SHIFT)

/* I2C FIFO Control */

#define I2CSC_FIFOCTRL_TXTRIG_SHIFT    (0)       /* Bits 2-0: TX FIFO Trigger */
#define I2CSC_FIFOCTRL_TXTRIG_MASK     (7 << I2CSC_FIFOCTRL_TXTRIG_SHIFT)
#  define I2CSC_FIFOCTRL_TXTRIG(n)     ((uint32_)(n) << I2CSC_FIFOCTRL_TXTRIG_SHIFT)
#define I2CSC_FIFOCTRL_DMATXENA        (1 << 13) /* Bit 13: DMA TX Channel Enable */
#define I2CSC_FIFOCTRL_TXFLUSH         (1 << 14) /* Bit 14: TX FIFO Flush */
#define I2CSC_FIFOCTRL_TXASGNMT        (1 << 15) /* Bit 15: TX Control Assignment */
#define I2CSC_FIFOCTRL_RXTRIG_SHIFT    (16)      /* Bits 18-16: RX FIFO Trigger */
#define I2CSC_FIFOCTRL_RXTRIG_MASK     (7 << I2CSC_FIFOCTRL_RXTRIG_SHIFT)
#  define I2CSC_FIFOCTRL_RXTRIG(n)     ((uint32_t)(n) << I2CSC_FIFOCTRL_RXTRIG_SHIFT)
#define I2CSC_FIFOCTRL_DMARXENA        (1 << 20) /* Bit 29: DMA RX Channel Enable */
#define I2CSC_FIFOCTRL_RXFLUSH         (1 << 30) /* Bit 30: RX FIFO Flush */
#define I2CSC_FIFOCTRL_RXASGNMT        (1 << 31) /* Bit 31: RX Control Assignment */

/* I2C FIFO Status */

#define I2CSC_FIFOSTATUS_TXFE          (1 << 0)  /* Bit 0:  TX FIFO Empty */
#define I2CSC_FIFOSTATUS_TXFF          (1 << 1)  /* Bit 1:  TX FIFO Full */
#define I2CSC_FIFOSTATUS_TXBLWTRIG     (1 << 2)  /* Bit 2:  TX FIFO Below Trigger Level */
#define I2CSC_FIFOSTATUS_RXFE          (1 << 16) /* Bit 16: RX FIFO Empty */
#define I2CSC_FIFOSTATUS_RXFF          (1 << 17) /* Bit 17: RX FIFO Full */
#define I2CSC_FIFOSTATUS_RXABVTRIG     (1 << 18) /* Bit 18: RX FIFO Above Trigger Level */

/* I2C Peripheral Properties */

#define I2CSC_PP_HS                    (1 << 0)  /* Bit 0:  High-Speed Capable */

/* I2C Peripheral Configuration */

#define I2CSC_PC_HS                    (1 << 0)  /* Bit 0:  High-Speed Capable */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C129_I2C_H */
